MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
// Register: CLKRCLK
#define CLKRCLK CLKRCLK
extern volatile unsigned char           CLKRCLK             __at(0x03A);
#ifndef _LIB_BUILD
asm("CLKRCLK equ 03Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLKRCLK0               :1;
        unsigned CLKRCLK1               :1;
        unsigned CLKRCLK2               :1;
        unsigned CLKRCLK3               :1;
        unsigned CLKRCLK4               :1;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
        unsigned CLK4                   :1;
    };
} CLKRCLKbits_t;
extern volatile CLKRCLKbits_t CLKRCLKbits __at(0x03A);
// bitfield macros
#define _CLKRCLK_CLK_POSN                                   0x0
#define _CLKRCLK_CLK_POSITION                               0x0
#define _CLKRCLK_CLK_SIZE                                   0x8
#define _CLKRCLK_CLK_LENGTH                                 0x8
#define _CLKRCLK_CLK_MASK                                   0xFF
#define _CLKRCLK_CLKRCLK0_POSN                              0x0
#define _CLKRCLK_CLKRCLK0_POSITION                          0x0
#define _CLKRCLK_CLKRCLK0_SIZE                              0x1
#define _CLKRCLK_CLKRCLK0_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK0_MASK                              0x1
#define _CLKRCLK_CLKRCLK1_POSN                              0x1
#define _CLKRCLK_CLKRCLK1_POSITION                          0x1
#define _CLKRCLK_CLKRCLK1_SIZE                              0x1
#define _CLKRCLK_CLKRCLK1_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK1_MASK                              0x2
#define _CLKRCLK_CLKRCLK2_POSN                              0x2
#define _CLKRCLK_CLKRCLK2_POSITION                          0x2
#define _CLKRCLK_CLKRCLK2_SIZE                              0x1
#define _CLKRCLK_CLKRCLK2_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK2_MASK                              0x4
#define _CLKRCLK_CLKRCLK3_POSN                              0x3
#define _CLKRCLK_CLKRCLK3_POSITION                          0x3
#define _CLKRCLK_CLKRCLK3_SIZE                              0x1
#define _CLKRCLK_CLKRCLK3_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK3_MASK                              0x8
#define _CLKRCLK_CLKRCLK4_POSN                              0x4
#define _CLKRCLK_CLKRCLK4_POSITION                          0x4
#define _CLKRCLK_CLKRCLK4_SIZE                              0x1
#define _CLKRCLK_CLKRCLK4_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK4_MASK                              0x10
#define _CLKRCLK_CLK0_POSN                                  0x0
#define _CLKRCLK_CLK0_POSITION                              0x0
#define _CLKRCLK_CLK0_SIZE                                  0x1
#define _CLKRCLK_CLK0_LENGTH                                0x1
#define _CLKRCLK_CLK0_MASK                                  0x1
#define _CLKRCLK_CLK1_POSN                                  0x1
#define _CLKRCLK_CLK1_POSITION                              0x1
#define _CLKRCLK_CLK1_SIZE                                  0x1
#define _CLKRCLK_CLK1_LENGTH                                0x1
#define _CLKRCLK_CLK1_MASK                                  0x2
#define _CLKRCLK_CLK2_POSN                                  0x2
#define _CLKRCLK_CLK2_POSITION                              0x2
#define _CLKRCLK_CLK2_SIZE                                  0x1
#define _CLKRCLK_CLK2_LENGTH                                0x1
#define _CLKRCLK_CLK2_MASK                                  0x4
#define _CLKRCLK_CLK3_POSN                                  0x3
#define _CLKRCLK_CLK3_POSITION                              0x3
#define _CLKRCLK_CLK3_SIZE                                  0x1
#define _CLKRCLK_CLK3_LENGTH                                0x1
#define _CLKRCLK_CLK3_MASK                                  0x8
#define _CLKRCLK_CLK4_POSN                                  0x4
#define _CLKRCLK_CLK4_POSITION                              0x4
#define _CLKRCLK_CLK4_SIZE                                  0x1
#define _CLKRCLK_CLK4_LENGTH                                0x1
#define _CLKRCLK_CLK4_MASK                                  0x10

// Register: NVMCON0
#define NVMCON0 NVMCON0
extern volatile unsigned char           NVMCON0             __at(0x040);
#ifndef _LIB_BUILD
asm("NVMCON0 equ 040h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned GO                     :1;
    };
    struct {
        unsigned NOT_DONE               :1;
    };
    struct {
        unsigned nDONE                  :1;
    };
    struct {
        unsigned NVMGO                  :1;
    };
} NVMCON0bits_t;
extern volatile NVMCON0bits_t NVMCON0bits __at(0x040);
// bitfield macros
#define _NVMCON0_GO_POSN                                    0x0
#define _NVMCON0_GO_POSITION                                0x0
#define _NVMCON0_GO_SIZE                                    0x1
#define _NVMCON0_GO_LENGTH                                  0x1
#define _NVMCON0_GO_MASK                                    0x1
#define _NVMCON0_NOT_DONE_POSN                              0x0
#define _NVMCON0_NOT_DONE_POSITION                          0x0
#define _NVMCON0_NOT_DONE_SIZE                              0x1
#define _NVMCON0_NOT_DONE_LENGTH                            0x1
#define _NVMCON0_NOT_DONE_MASK                              0x1
#define _NVMCON0_nDONE_POSN                                 0x0
#define _NVMCON0_nDONE_POSITION                             0x0
#define _NVMCON0_nDONE_SIZE                                 0x1
#define _NVMCON0_nDONE_LENGTH                               0x1
#define _NVMCON0_nDONE_MASK                                 0x1
#define _NVMCON0_NVMGO_POSN                                 0x0
#define _NVMCON0_NVMGO_POSITION                             0x0
#define _NVMCON0_NVMGO_SIZE                                 0x1
#define _NVMCON0_NVMGO_LENGTH                               0x1
#define _NVMCON0_NVMGO_MASK                                 0x1

// Register: NVMCON1
#define NVMCON1 NVMCON1
extern volatile unsigned char           NVMCON1             __at(0x041);
#ifndef _LIB_BUILD
asm("NVMCON1 equ 041h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMD                    :3;
        unsigned                        :4;
        unsigned WRERR                  :1;
    };
    struct {
        unsigned NVMCMD                 :3;
    };
} NVMCON1bits_t;
extern volatile NVMCON1bits_t NVMCON1bits __at(0x041);
// bitfield macros
#define _NVMCON1_CMD_POSN                                   0x0
#define _NVMCON1_CMD_POSITION                               0x0
#define _NVMCON1_CMD_SIZE                                   0x3
#define _NVMCON1_CMD_LENGTH                                 0x3
#define _NVMCON1_CMD_MASK                                   0x7
#define _NVMCON1_WRERR_POSN                                 0x7
#define _NVMCON1_WRERR_POSITION                             0x7
#define _NVMCON1_WRERR_SIZE                                 0x1
#define _NVMCON1_WRERR_LENGTH                               0x1
#define _NVMCON1_WRERR_MASK                                 0x80
#define _NVMCON1_NVMCMD_POSN                                0x0
#define _NVMCON1_NVMCMD_POSITION                            0x0
#define _NVMCON1_NVMCMD_SIZE                                0x3
#define _NVMCON1_NVMCMD_LENGTH                              0x3
#define _NVMCON1_NVMCMD_MASK                                0x7

// Register: NVMLOCK
#define NVMLOCK NVMLOCK
extern volatile unsigned char           NVMLOCK             __at(0x042);
#ifndef _LIB_BUILD
asm("NVMLOCK equ 042h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LOCK                   :8;
    };
} NVMLOCKbits_t;
extern volatile NVMLOCKbits_t NVMLOCKbits __at(0x042);
// bitfield macros
#define _NVMLOCK_LOCK_POSN                                  0x0
#define _NVMLOCK_LOCK_POSITION                              0x0
#define _NVMLOCK_LOCK_SIZE                                  0x8
#define _NVMLOCK_LOCK_LENGTH                                0x8
#define _NVMLOCK_LOCK_MASK                                  0xFF

// Register: NVMADR
#define NVMADR NVMADR
#ifndef __CCI__
extern volatile __uint24                NVMADR              __at(0x043);
#endif
#ifndef _LIB_BUILD
asm("NVMADR equ 043h");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x043);
#ifndef _LIB_BUILD
asm("NVMADRL equ 043h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL                :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x043);
// bitfield macros
#define _NVMADRL_NVMADRL_POSN                               0x0
#define _NVMADRL_NVMADRL_POSITION                           0x0
#define _NVMADRL_NVMADRL_SIZE                               0x8
#define _NVMADRL_NVMADRL_LENGTH                             0x8
#define _NVMADRL_NVMADRL_MASK                               0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

