MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
extern volatile PMD5bits_t PMD5bits __at(0x065);
// bitfield macros
#define _PMD5_CCP1MD_POSN                                   0x0
#define _PMD5_CCP1MD_POSITION                               0x0
#define _PMD5_CCP1MD_SIZE                                   0x1
#define _PMD5_CCP1MD_LENGTH                                 0x1
#define _PMD5_CCP1MD_MASK                                   0x1
#define _PMD5_CCP2MD_POSN                                   0x1
#define _PMD5_CCP2MD_POSITION                               0x1
#define _PMD5_CCP2MD_SIZE                                   0x1
#define _PMD5_CCP2MD_LENGTH                                 0x1
#define _PMD5_CCP2MD_MASK                                   0x2
#define _PMD5_CCP3MD_POSN                                   0x2
#define _PMD5_CCP3MD_POSITION                               0x2
#define _PMD5_CCP3MD_SIZE                                   0x1
#define _PMD5_CCP3MD_LENGTH                                 0x1
#define _PMD5_CCP3MD_MASK                                   0x4
#define _PMD5_PWM1MD_POSN                                   0x4
#define _PMD5_PWM1MD_POSITION                               0x4
#define _PMD5_PWM1MD_SIZE                                   0x1
#define _PMD5_PWM1MD_LENGTH                                 0x1
#define _PMD5_PWM1MD_MASK                                   0x10
#define _PMD5_PWM2MD_POSN                                   0x5
#define _PMD5_PWM2MD_POSITION                               0x5
#define _PMD5_PWM2MD_SIZE                                   0x1
#define _PMD5_PWM2MD_LENGTH                                 0x1
#define _PMD5_PWM2MD_MASK                                   0x20
#define _PMD5_PWM3MD_POSN                                   0x6
#define _PMD5_PWM3MD_POSITION                               0x6
#define _PMD5_PWM3MD_SIZE                                   0x1
#define _PMD5_PWM3MD_LENGTH                                 0x1
#define _PMD5_PWM3MD_MASK                                   0x40

// Register: PMD6
#define PMD6 PMD6
extern volatile unsigned char           PMD6                __at(0x066);
#ifndef _LIB_BUILD
asm("PMD6 equ 066h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1MD                 :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
        unsigned U1MD                   :1;
        unsigned U2MD                   :1;
        unsigned U3MD                   :1;
        unsigned U4MD                   :1;
        unsigned U5MD                   :1;
    };
} PMD6bits_t;
extern volatile PMD6bits_t PMD6bits __at(0x066);
// bitfield macros
#define _PMD6_I2C1MD_POSN                                   0x0
#define _PMD6_I2C1MD_POSITION                               0x0
#define _PMD6_I2C1MD_SIZE                                   0x1
#define _PMD6_I2C1MD_LENGTH                                 0x1
#define _PMD6_I2C1MD_MASK                                   0x1
#define _PMD6_SPI1MD_POSN                                   0x1
#define _PMD6_SPI1MD_POSITION                               0x1
#define _PMD6_SPI1MD_SIZE                                   0x1
#define _PMD6_SPI1MD_LENGTH                                 0x1
#define _PMD6_SPI1MD_MASK                                   0x2
#define _PMD6_SPI2MD_POSN                                   0x2
#define _PMD6_SPI2MD_POSITION                               0x2
#define _PMD6_SPI2MD_SIZE                                   0x1
#define _PMD6_SPI2MD_LENGTH                                 0x1
#define _PMD6_SPI2MD_MASK                                   0x4
#define _PMD6_U1MD_POSN                                     0x3
#define _PMD6_U1MD_POSITION                                 0x3
#define _PMD6_U1MD_SIZE                                     0x1
#define _PMD6_U1MD_LENGTH                                   0x1
#define _PMD6_U1MD_MASK                                     0x8
#define _PMD6_U2MD_POSN                                     0x4
#define _PMD6_U2MD_POSITION                                 0x4
#define _PMD6_U2MD_SIZE                                     0x1
#define _PMD6_U2MD_LENGTH                                   0x1
#define _PMD6_U2MD_MASK                                     0x10
#define _PMD6_U3MD_POSN                                     0x5
#define _PMD6_U3MD_POSITION                                 0x5
#define _PMD6_U3MD_SIZE                                     0x1
#define _PMD6_U3MD_LENGTH                                   0x1
#define _PMD6_U3MD_MASK                                     0x20
#define _PMD6_U4MD_POSN                                     0x6
#define _PMD6_U4MD_POSITION                                 0x6
#define _PMD6_U4MD_SIZE                                     0x1
#define _PMD6_U4MD_LENGTH                                   0x1
#define _PMD6_U4MD_MASK                                     0x40
#define _PMD6_U5MD_POSN                                     0x7
#define _PMD6_U5MD_POSITION                                 0x7
#define _PMD6_U5MD_SIZE                                     0x1
#define _PMD6_U5MD_LENGTH                                   0x1
#define _PMD6_U5MD_MASK                                     0x80

// Register: PMD7
#define PMD7 PMD7
extern volatile unsigned char           PMD7                __at(0x067);
#ifndef _LIB_BUILD
asm("PMD7 equ 067h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLC1MD                 :1;
        unsigned CLC2MD                 :1;
        unsigned CLC3MD                 :1;
        unsigned CLC4MD                 :1;
        unsigned CLC5MD                 :1;
        unsigned CLC6MD                 :1;
        unsigned CLC7MD                 :1;
        unsigned CLC8MD                 :1;
    };
} PMD7bits_t;
extern volatile PMD7bits_t PMD7bits __at(0x067);
// bitfield macros
#define _PMD7_CLC1MD_POSN                                   0x0
#define _PMD7_CLC1MD_POSITION                               0x0
#define _PMD7_CLC1MD_SIZE                                   0x1
#define _PMD7_CLC1MD_LENGTH                                 0x1
#define _PMD7_CLC1MD_MASK                                   0x1
#define _PMD7_CLC2MD_POSN                                   0x1
#define _PMD7_CLC2MD_POSITION                               0x1
#define _PMD7_CLC2MD_SIZE                                   0x1
#define _PMD7_CLC2MD_LENGTH                                 0x1
#define _PMD7_CLC2MD_MASK                                   0x2
#define _PMD7_CLC3MD_POSN                                   0x2
#define _PMD7_CLC3MD_POSITION                               0x2
#define _PMD7_CLC3MD_SIZE                                   0x1
#define _PMD7_CLC3MD_LENGTH                                 0x1
#define _PMD7_CLC3MD_MASK                                   0x4
#define _PMD7_CLC4MD_POSN                                   0x3
#define _PMD7_CLC4MD_POSITION                               0x3
#define _PMD7_CLC4MD_SIZE                                   0x1
#define _PMD7_CLC4MD_LENGTH                                 0x1
#define _PMD7_CLC4MD_MASK                                   0x8
#define _PMD7_CLC5MD_POSN                                   0x4
#define _PMD7_CLC5MD_POSITION                               0x4
#define _PMD7_CLC5MD_SIZE                                   0x1
#define _PMD7_CLC5MD_LENGTH                                 0x1
#define _PMD7_CLC5MD_MASK                                   0x10
#define _PMD7_CLC6MD_POSN                                   0x5
#define _PMD7_CLC6MD_POSITION                               0x5
#define _PMD7_CLC6MD_SIZE                                   0x1
#define _PMD7_CLC6MD_LENGTH                                 0x1
#define _PMD7_CLC6MD_MASK                                   0x20
#define _PMD7_CLC7MD_POSN                                   0x6
#define _PMD7_CLC7MD_POSITION                               0x6
#define _PMD7_CLC7MD_SIZE                                   0x1
#define _PMD7_CLC7MD_LENGTH                                 0x1
#define _PMD7_CLC7MD_MASK                                   0x40
#define _PMD7_CLC8MD_POSN                                   0x7
#define _PMD7_CLC8MD_POSITION                               0x7
#define _PMD7_CLC8MD_SIZE                                   0x1
#define _PMD7_CLC8MD_LENGTH                                 0x1
#define _PMD7_CLC8MD_MASK                                   0x80

// Register: PMD8
#define PMD8 PMD8
extern volatile unsigned char           PMD8                __at(0x068);
#ifndef _LIB_BUILD
asm("PMD8 equ 068h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMA1MD                 :1;
        unsigned DMA2MD                 :1;
        unsigned DMA3MD                 :1;
        unsigned DMA4MD                 :1;
        unsigned DMA5MD                 :1;
        unsigned DMA6MD                 :1;
    };
} PMD8bits_t;
extern volatile PMD8bits_t PMD8bits __at(0x068);
// bitfield macros
#define _PMD8_DMA1MD_POSN                                   0x0
#define _PMD8_DMA1MD_POSITION                               0x0
#define _PMD8_DMA1MD_SIZE                                   0x1
#define _PMD8_DMA1MD_LENGTH                                 0x1
#define _PMD8_DMA1MD_MASK                                   0x1
#define _PMD8_DMA2MD_POSN                                   0x1
#define _PMD8_DMA2MD_POSITION                               0x1
#define _PMD8_DMA2MD_SIZE                                   0x1
#define _PMD8_DMA2MD_LENGTH                                 0x1
#define _PMD8_DMA2MD_MASK                                   0x2
#define _PMD8_DMA3MD_POSN                                   0x2
#define _PMD8_DMA3MD_POSITION                               0x2
#define _PMD8_DMA3MD_SIZE                                   0x1
#define _PMD8_DMA3MD_LENGTH                                 0x1
#define _PMD8_DMA3MD_MASK                                   0x4
#define _PMD8_DMA4MD_POSN                                   0x3
#define _PMD8_DMA4MD_POSITION                               0x3
#define _PMD8_DMA4MD_SIZE                                   0x1
#define _PMD8_DMA4MD_LENGTH                                 0x1
#define _PMD8_DMA4MD_MASK                                   0x8
#define _PMD8_DMA5MD_POSN                                   0x4
#define _PMD8_DMA5MD_POSITION                               0x4
#define _PMD8_DMA5MD_SIZE                                   0x1
#define _PMD8_DMA5MD_LENGTH                                 0x1
#define _PMD8_DMA5MD_MASK                                   0x10
#define _PMD8_DMA6MD_POSN                                   0x5
#define _PMD8_DMA6MD_POSITION                               0x5
#define _PMD8_DMA6MD_SIZE                                   0x1
#define _PMD8_DMA6MD_LENGTH                                 0x1
#define _PMD8_DMA6MD_MASK                                   0x20

// Register: MD1CON0
#define MD1CON0 MD1CON0
extern volatile unsigned char           MD1CON0             __at(0x06A);
#ifndef _LIB_BUILD
asm("MD1CON0 equ 06Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BIT                    :1;
        unsigned                        :3;
        unsigned OPOL                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD1BIT                 :1;
        unsigned                        :3;
        unsigned MD1OPOL                :1;
        unsigned MD1OUT                 :1;
        unsigned                        :1;
        unsigned MD1EN                  :1;
    };
} MD1CON0bits_t;
extern volatile MD1CON0bits_t MD1CON0bits __at(0x06A);
// bitfield macros
#define _MD1CON0_BIT_POSN                                   0x0
#define _MD1CON0_BIT_POSITION                               0x0
#define _MD1CON0_BIT_SIZE                                   0x1
#define _MD1CON0_BIT_LENGTH                                 0x1
#define _MD1CON0_BIT_MASK                                   0x1
#define _MD1CON0_OPOL_POSN                                  0x4
#define _MD1CON0_OPOL_POSITION                              0x4
#define _MD1CON0_OPOL_SIZE                                  0x1
#define _MD1CON0_OPOL_LENGTH                                0x1
#define _MD1CON0_OPOL_MASK                                  0x10
#define _MD1CON0_OUT_POSN                                   0x5
#define _MD1CON0_OUT_POSITION                               0x5
#define _MD1CON0_OUT_SIZE                                   0x1
#define _MD1CON0_OUT_LENGTH                                 0x1
#define _MD1CON0_OUT_MASK                                   0x20
#define _MD1CON0_EN_POSN                                    0x7
#define _MD1CON0_EN_POSITION                                0x7
#define _MD1CON0_EN_SIZE                                    0x1
#define _MD1CON0_EN_LENGTH                                  0x1
#define _MD1CON0_EN_MASK                                    0x80
#define _MD1CON0_MD1BIT_POSN                                0x0
#define _MD1CON0_MD1BIT_POSITION                            0x0
#define _MD1CON0_MD1BIT_SIZE                                0x1
#define _MD1CON0_MD1BIT_LENGTH                              0x1
#define _MD1CON0_MD1BIT_MASK                                0x1
#define _MD1CON0_MD1OPOL_POSN                               0x4
#define _MD1CON0_MD1OPOL_POSITION                           0x4
#define _MD1CON0_MD1OPOL_SIZE                               0x1
#define _MD1CON0_MD1OPOL_LENGTH                             0x1
#define _MD1CON0_MD1OPOL_MASK                               0x10
#define _MD1CON0_MD1OUT_POSN                                0x5
#define _MD1CON0_MD1OUT_POSITION                            0x5
#define _MD1CON0_MD1OUT_SIZE                                0x1
#define _MD1CON0_MD1OUT_LENGTH                              0x1
#define _MD1CON0_MD1OUT_MASK                                0x20
#define _MD1CON0_MD1EN_POSN                                 0x7
#define _MD1CON0_MD1EN_POSITION                             0x7
#define _MD1CON0_MD1EN_SIZE                                 0x1
#define _MD1CON0_MD1EN_LENGTH                               0x1
#define _MD1CON0_MD1EN_MASK                                 0x80

