MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
extern volatile DMAnSPTRUbits_t DMAnSPTRUbits __at(0x0F6);
// bitfield macros
#define _DMAnSPTRU_SPTR_POSN                                0x0
#define _DMAnSPTRU_SPTR_POSITION                            0x0
#define _DMAnSPTRU_SPTR_SIZE                                0x8
#define _DMAnSPTRU_SPTR_LENGTH                              0x8
#define _DMAnSPTRU_SPTR_MASK                                0xFF
#define _DMAnSPTRU_SPTR16_POSN                              0x0
#define _DMAnSPTRU_SPTR16_POSITION                          0x0
#define _DMAnSPTRU_SPTR16_SIZE                              0x1
#define _DMAnSPTRU_SPTR16_LENGTH                            0x1
#define _DMAnSPTRU_SPTR16_MASK                              0x1
#define _DMAnSPTRU_SPTR17_POSN                              0x1
#define _DMAnSPTRU_SPTR17_POSITION                          0x1
#define _DMAnSPTRU_SPTR17_SIZE                              0x1
#define _DMAnSPTRU_SPTR17_LENGTH                            0x1
#define _DMAnSPTRU_SPTR17_MASK                              0x2
#define _DMAnSPTRU_SPTR18_POSN                              0x2
#define _DMAnSPTRU_SPTR18_POSITION                          0x2
#define _DMAnSPTRU_SPTR18_SIZE                              0x1
#define _DMAnSPTRU_SPTR18_LENGTH                            0x1
#define _DMAnSPTRU_SPTR18_MASK                              0x4
#define _DMAnSPTRU_SPTR19_POSN                              0x3
#define _DMAnSPTRU_SPTR19_POSITION                          0x3
#define _DMAnSPTRU_SPTR19_SIZE                              0x1
#define _DMAnSPTRU_SPTR19_LENGTH                            0x1
#define _DMAnSPTRU_SPTR19_MASK                              0x8
#define _DMAnSPTRU_SPTR20_POSN                              0x4
#define _DMAnSPTRU_SPTR20_POSITION                          0x4
#define _DMAnSPTRU_SPTR20_SIZE                              0x1
#define _DMAnSPTRU_SPTR20_LENGTH                            0x1
#define _DMAnSPTRU_SPTR20_MASK                              0x10
#define _DMAnSPTRU_SPTR21_POSN                              0x5
#define _DMAnSPTRU_SPTR21_POSITION                          0x5
#define _DMAnSPTRU_SPTR21_SIZE                              0x1
#define _DMAnSPTRU_SPTR21_LENGTH                            0x1
#define _DMAnSPTRU_SPTR21_MASK                              0x20

// Register: DMAnSSZ
#define DMAnSSZ DMAnSSZ
extern volatile unsigned short          DMAnSSZ             __at(0x0F7);
#ifndef _LIB_BUILD
asm("DMAnSSZ equ 0F7h");
#endif

// Register: DMAnSSZL
#define DMAnSSZL DMAnSSZL
extern volatile unsigned char           DMAnSSZL            __at(0x0F7);
#ifndef _LIB_BUILD
asm("DMAnSSZL equ 0F7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned SSZ0                   :1;
        unsigned SSZ1                   :1;
        unsigned SSZ2                   :1;
        unsigned SSZ3                   :1;
        unsigned SSZ4                   :1;
        unsigned SSZ5                   :1;
        unsigned SSZ6                   :1;
        unsigned SSZ7                   :1;
    };
} DMAnSSZLbits_t;
extern volatile DMAnSSZLbits_t DMAnSSZLbits __at(0x0F7);
// bitfield macros
#define _DMAnSSZL_SSZ_POSN                                  0x0
#define _DMAnSSZL_SSZ_POSITION                              0x0
#define _DMAnSSZL_SSZ_SIZE                                  0x8
#define _DMAnSSZL_SSZ_LENGTH                                0x8
#define _DMAnSSZL_SSZ_MASK                                  0xFF
#define _DMAnSSZL_SSZ0_POSN                                 0x0
#define _DMAnSSZL_SSZ0_POSITION                             0x0
#define _DMAnSSZL_SSZ0_SIZE                                 0x1
#define _DMAnSSZL_SSZ0_LENGTH                               0x1
#define _DMAnSSZL_SSZ0_MASK                                 0x1
#define _DMAnSSZL_SSZ1_POSN                                 0x1
#define _DMAnSSZL_SSZ1_POSITION                             0x1
#define _DMAnSSZL_SSZ1_SIZE                                 0x1
#define _DMAnSSZL_SSZ1_LENGTH                               0x1
#define _DMAnSSZL_SSZ1_MASK                                 0x2
#define _DMAnSSZL_SSZ2_POSN                                 0x2
#define _DMAnSSZL_SSZ2_POSITION                             0x2
#define _DMAnSSZL_SSZ2_SIZE                                 0x1
#define _DMAnSSZL_SSZ2_LENGTH                               0x1
#define _DMAnSSZL_SSZ2_MASK                                 0x4
#define _DMAnSSZL_SSZ3_POSN                                 0x3
#define _DMAnSSZL_SSZ3_POSITION                             0x3
#define _DMAnSSZL_SSZ3_SIZE                                 0x1
#define _DMAnSSZL_SSZ3_LENGTH                               0x1
#define _DMAnSSZL_SSZ3_MASK                                 0x8
#define _DMAnSSZL_SSZ4_POSN                                 0x4
#define _DMAnSSZL_SSZ4_POSITION                             0x4
#define _DMAnSSZL_SSZ4_SIZE                                 0x1
#define _DMAnSSZL_SSZ4_LENGTH                               0x1
#define _DMAnSSZL_SSZ4_MASK                                 0x10
#define _DMAnSSZL_SSZ5_POSN                                 0x5
#define _DMAnSSZL_SSZ5_POSITION                             0x5
#define _DMAnSSZL_SSZ5_SIZE                                 0x1
#define _DMAnSSZL_SSZ5_LENGTH                               0x1
#define _DMAnSSZL_SSZ5_MASK                                 0x20
#define _DMAnSSZL_SSZ6_POSN                                 0x6
#define _DMAnSSZL_SSZ6_POSITION                             0x6
#define _DMAnSSZL_SSZ6_SIZE                                 0x1
#define _DMAnSSZL_SSZ6_LENGTH                               0x1
#define _DMAnSSZL_SSZ6_MASK                                 0x40
#define _DMAnSSZL_SSZ7_POSN                                 0x7
#define _DMAnSSZL_SSZ7_POSITION                             0x7
#define _DMAnSSZL_SSZ7_SIZE                                 0x1
#define _DMAnSSZL_SSZ7_LENGTH                               0x1
#define _DMAnSSZL_SSZ7_MASK                                 0x80

// Register: DMAnSSZH
#define DMAnSSZH DMAnSSZH
extern volatile unsigned char           DMAnSSZH            __at(0x0F8);
#ifndef _LIB_BUILD
asm("DMAnSSZH equ 0F8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSZ                    :8;
    };
    struct {
        unsigned SSZ8                   :1;
        unsigned SSZ9                   :1;
        unsigned SSZ10                  :1;
        unsigned SSZ11                  :1;
    };
} DMAnSSZHbits_t;
extern volatile DMAnSSZHbits_t DMAnSSZHbits __at(0x0F8);
// bitfield macros
#define _DMAnSSZH_SSZ_POSN                                  0x0
#define _DMAnSSZH_SSZ_POSITION                              0x0
#define _DMAnSSZH_SSZ_SIZE                                  0x8
#define _DMAnSSZH_SSZ_LENGTH                                0x8
#define _DMAnSSZH_SSZ_MASK                                  0xFF
#define _DMAnSSZH_SSZ8_POSN                                 0x0
#define _DMAnSSZH_SSZ8_POSITION                             0x0
#define _DMAnSSZH_SSZ8_SIZE                                 0x1
#define _DMAnSSZH_SSZ8_LENGTH                               0x1
#define _DMAnSSZH_SSZ8_MASK                                 0x1
#define _DMAnSSZH_SSZ9_POSN                                 0x1
#define _DMAnSSZH_SSZ9_POSITION                             0x1
#define _DMAnSSZH_SSZ9_SIZE                                 0x1
#define _DMAnSSZH_SSZ9_LENGTH                               0x1
#define _DMAnSSZH_SSZ9_MASK                                 0x2
#define _DMAnSSZH_SSZ10_POSN                                0x2
#define _DMAnSSZH_SSZ10_POSITION                            0x2
#define _DMAnSSZH_SSZ10_SIZE                                0x1
#define _DMAnSSZH_SSZ10_LENGTH                              0x1
#define _DMAnSSZH_SSZ10_MASK                                0x4
#define _DMAnSSZH_SSZ11_POSN                                0x3
#define _DMAnSSZH_SSZ11_POSITION                            0x3
#define _DMAnSSZH_SSZ11_SIZE                                0x1
#define _DMAnSSZH_SSZ11_LENGTH                              0x1
#define _DMAnSSZH_SSZ11_MASK                                0x8

// Register: DMAnSSA
#define DMAnSSA DMAnSSA
#ifndef __CCI__
extern volatile __uint24                DMAnSSA             __at(0x0F9);
#endif
#ifndef _LIB_BUILD
asm("DMAnSSA equ 0F9h");
#endif

// Register: DMAnSSAL
#define DMAnSSAL DMAnSSAL
extern volatile unsigned char           DMAnSSAL            __at(0x0F9);
#ifndef _LIB_BUILD
asm("DMAnSSAL equ 0F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSA                    :8;
    };
    struct {
        unsigned SSA0                   :1;
        unsigned SSA1                   :1;
        unsigned SSA2                   :1;
        unsigned SSA3                   :1;
        unsigned SSA4                   :1;
        unsigned SSA5                   :1;
        unsigned SSA6                   :1;
        unsigned SSA7                   :1;
    };
} DMAnSSALbits_t;
extern volatile DMAnSSALbits_t DMAnSSALbits __at(0x0F9);
// bitfield macros
#define _DMAnSSAL_SSA_POSN                                  0x0
#define _DMAnSSAL_SSA_POSITION                              0x0
#define _DMAnSSAL_SSA_SIZE                                  0x8
#define _DMAnSSAL_SSA_LENGTH                                0x8
#define _DMAnSSAL_SSA_MASK                                  0xFF
#define _DMAnSSAL_SSA0_POSN                                 0x0
#define _DMAnSSAL_SSA0_POSITION                             0x0
#define _DMAnSSAL_SSA0_SIZE                                 0x1
#define _DMAnSSAL_SSA0_LENGTH                               0x1
#define _DMAnSSAL_SSA0_MASK                                 0x1
#define _DMAnSSAL_SSA1_POSN                                 0x1
#define _DMAnSSAL_SSA1_POSITION                             0x1
#define _DMAnSSAL_SSA1_SIZE                                 0x1
#define _DMAnSSAL_SSA1_LENGTH                               0x1
#define _DMAnSSAL_SSA1_MASK                                 0x2
#define _DMAnSSAL_SSA2_POSN                                 0x2
#define _DMAnSSAL_SSA2_POSITION                             0x2
#define _DMAnSSAL_SSA2_SIZE                                 0x1
#define _DMAnSSAL_SSA2_LENGTH                               0x1
#define _DMAnSSAL_SSA2_MASK                                 0x4
#define _DMAnSSAL_SSA3_POSN                                 0x3
#define _DMAnSSAL_SSA3_POSITION                             0x3
#define _DMAnSSAL_SSA3_SIZE                                 0x1
#define _DMAnSSAL_SSA3_LENGTH                               0x1
#define _DMAnSSAL_SSA3_MASK                                 0x8
#define _DMAnSSAL_SSA4_POSN                                 0x4
#define _DMAnSSAL_SSA4_POSITION                             0x4
#define _DMAnSSAL_SSA4_SIZE                                 0x1
#define _DMAnSSAL_SSA4_LENGTH                               0x1
#define _DMAnSSAL_SSA4_MASK                                 0x10
#define _DMAnSSAL_SSA5_POSN                                 0x5
#define _DMAnSSAL_SSA5_POSITION                             0x5
#define _DMAnSSAL_SSA5_SIZE                                 0x1
#define _DMAnSSAL_SSA5_LENGTH                               0x1
#define _DMAnSSAL_SSA5_MASK                                 0x20
#define _DMAnSSAL_SSA6_POSN                                 0x6
#define _DMAnSSAL_SSA6_POSITION                             0x6
#define _DMAnSSAL_SSA6_SIZE                                 0x1
#define _DMAnSSAL_SSA6_LENGTH                               0x1
#define _DMAnSSAL_SSA6_MASK                                 0x40
#define _DMAnSSAL_SSA7_POSN                                 0x7
#define _DMAnSSAL_SSA7_POSITION                             0x7
#define _DMAnSSAL_SSA7_SIZE                                 0x1
#define _DMAnSSAL_SSA7_LENGTH                               0x1
#define _DMAnSSAL_SSA7_MASK                                 0x80

