MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
extern volatile U5P1Lbits_t U5P1Lbits __at(0x2F1);
// bitfield macros
#define _U5P1L_P1L_POSN                                     0x0
#define _U5P1L_P1L_POSITION                                 0x0
#define _U5P1L_P1L_SIZE                                     0x8
#define _U5P1L_P1L_LENGTH                                   0x8
#define _U5P1L_P1L_MASK                                     0xFF

// Register: U5P2
#define U5P2 U5P2
extern volatile unsigned char           U5P2                __at(0x2F3);
#ifndef _LIB_BUILD
asm("U5P2 equ 02F3h");
#endif

// Register: U5P2L
#define U5P2L U5P2L
extern volatile unsigned char           U5P2L               __at(0x2F3);
#ifndef _LIB_BUILD
asm("U5P2L equ 02F3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
} U5P2Lbits_t;
extern volatile U5P2Lbits_t U5P2Lbits __at(0x2F3);
// bitfield macros
#define _U5P2L_P2L_POSN                                     0x0
#define _U5P2L_P2L_POSITION                                 0x0
#define _U5P2L_P2L_SIZE                                     0x8
#define _U5P2L_P2L_LENGTH                                   0x8
#define _U5P2L_P2L_MASK                                     0xFF

// Register: U5P3
#define U5P3 U5P3
extern volatile unsigned char           U5P3                __at(0x2F5);
#ifndef _LIB_BUILD
asm("U5P3 equ 02F5h");
#endif

// Register: U5P3L
#define U5P3L U5P3L
extern volatile unsigned char           U5P3L               __at(0x2F5);
#ifndef _LIB_BUILD
asm("U5P3L equ 02F5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P3L                    :8;
    };
} U5P3Lbits_t;
extern volatile U5P3Lbits_t U5P3Lbits __at(0x2F5);
// bitfield macros
#define _U5P3L_P3L_POSN                                     0x0
#define _U5P3L_P3L_POSITION                                 0x0
#define _U5P3L_P3L_SIZE                                     0x8
#define _U5P3L_P3L_LENGTH                                   0x8
#define _U5P3L_P3L_MASK                                     0xFF

// Register: U5CON0
#define U5CON0 U5CON0
extern volatile unsigned char           U5CON0              __at(0x2F7);
#ifndef _LIB_BUILD
asm("U5CON0 equ 02F7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned U5MODE                 :4;
        unsigned U5RXEN                 :1;
        unsigned U5TXEN                 :1;
        unsigned U5ABDEN                :1;
        unsigned U5BRGS                 :1;
    };
    struct {
        unsigned U5MODE0                :1;
        unsigned U5MODE1                :1;
        unsigned U5MODE2                :1;
    };
    struct {
        unsigned MODE                   :4;
        unsigned RXEN                   :1;
        unsigned TXEN                   :1;
        unsigned ABDEN                  :1;
        unsigned BRGS                   :1;
    };
} U5CON0bits_t;
extern volatile U5CON0bits_t U5CON0bits __at(0x2F7);
// bitfield macros
#define _U5CON0_MODE0_POSN                                  0x0
#define _U5CON0_MODE0_POSITION                              0x0
#define _U5CON0_MODE0_SIZE                                  0x1
#define _U5CON0_MODE0_LENGTH                                0x1
#define _U5CON0_MODE0_MASK                                  0x1
#define _U5CON0_MODE1_POSN                                  0x1
#define _U5CON0_MODE1_POSITION                              0x1
#define _U5CON0_MODE1_SIZE                                  0x1
#define _U5CON0_MODE1_LENGTH                                0x1
#define _U5CON0_MODE1_MASK                                  0x2
#define _U5CON0_MODE2_POSN                                  0x2
#define _U5CON0_MODE2_POSITION                              0x2
#define _U5CON0_MODE2_SIZE                                  0x1
#define _U5CON0_MODE2_LENGTH                                0x1
#define _U5CON0_MODE2_MASK                                  0x4
#define _U5CON0_U5MODE_POSN                                 0x0
#define _U5CON0_U5MODE_POSITION                             0x0
#define _U5CON0_U5MODE_SIZE                                 0x4
#define _U5CON0_U5MODE_LENGTH                               0x4
#define _U5CON0_U5MODE_MASK                                 0xF
#define _U5CON0_U5RXEN_POSN                                 0x4
#define _U5CON0_U5RXEN_POSITION                             0x4
#define _U5CON0_U5RXEN_SIZE                                 0x1
#define _U5CON0_U5RXEN_LENGTH                               0x1
#define _U5CON0_U5RXEN_MASK                                 0x10
#define _U5CON0_U5TXEN_POSN                                 0x5
#define _U5CON0_U5TXEN_POSITION                             0x5
#define _U5CON0_U5TXEN_SIZE                                 0x1
#define _U5CON0_U5TXEN_LENGTH                               0x1
#define _U5CON0_U5TXEN_MASK                                 0x20
#define _U5CON0_U5ABDEN_POSN                                0x6
#define _U5CON0_U5ABDEN_POSITION                            0x6
#define _U5CON0_U5ABDEN_SIZE                                0x1
#define _U5CON0_U5ABDEN_LENGTH                              0x1
#define _U5CON0_U5ABDEN_MASK                                0x40
#define _U5CON0_U5BRGS_POSN                                 0x7
#define _U5CON0_U5BRGS_POSITION                             0x7
#define _U5CON0_U5BRGS_SIZE                                 0x1
#define _U5CON0_U5BRGS_LENGTH                               0x1
#define _U5CON0_U5BRGS_MASK                                 0x80
#define _U5CON0_U5MODE0_POSN                                0x0
#define _U5CON0_U5MODE0_POSITION                            0x0
#define _U5CON0_U5MODE0_SIZE                                0x1
#define _U5CON0_U5MODE0_LENGTH                              0x1
#define _U5CON0_U5MODE0_MASK                                0x1
#define _U5CON0_U5MODE1_POSN                                0x1
#define _U5CON0_U5MODE1_POSITION                            0x1
#define _U5CON0_U5MODE1_SIZE                                0x1
#define _U5CON0_U5MODE1_LENGTH                              0x1
#define _U5CON0_U5MODE1_MASK                                0x2
#define _U5CON0_U5MODE2_POSN                                0x2
#define _U5CON0_U5MODE2_POSITION                            0x2
#define _U5CON0_U5MODE2_SIZE                                0x1
#define _U5CON0_U5MODE2_LENGTH                              0x1
#define _U5CON0_U5MODE2_MASK                                0x4
#define _U5CON0_MODE_POSN                                   0x0
#define _U5CON0_MODE_POSITION                               0x0
#define _U5CON0_MODE_SIZE                                   0x4
#define _U5CON0_MODE_LENGTH                                 0x4
#define _U5CON0_MODE_MASK                                   0xF
#define _U5CON0_RXEN_POSN                                   0x4
#define _U5CON0_RXEN_POSITION                               0x4
#define _U5CON0_RXEN_SIZE                                   0x1
#define _U5CON0_RXEN_LENGTH                                 0x1
#define _U5CON0_RXEN_MASK                                   0x10
#define _U5CON0_TXEN_POSN                                   0x5
#define _U5CON0_TXEN_POSITION                               0x5
#define _U5CON0_TXEN_SIZE                                   0x1
#define _U5CON0_TXEN_LENGTH                                 0x1
#define _U5CON0_TXEN_MASK                                   0x20
#define _U5CON0_ABDEN_POSN                                  0x6
#define _U5CON0_ABDEN_POSITION                              0x6
#define _U5CON0_ABDEN_SIZE                                  0x1
#define _U5CON0_ABDEN_LENGTH                                0x1
#define _U5CON0_ABDEN_MASK                                  0x40
#define _U5CON0_BRGS_POSN                                   0x7
#define _U5CON0_BRGS_POSITION                               0x7
#define _U5CON0_BRGS_SIZE                                   0x1
#define _U5CON0_BRGS_LENGTH                                 0x1
#define _U5CON0_BRGS_MASK                                   0x80

// Register: U5CON1
#define U5CON1 U5CON1
extern volatile unsigned char           U5CON1              __at(0x2F8);
#ifndef _LIB_BUILD
asm("U5CON1 equ 02F8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SENDB                  :1;
        unsigned BRKOVR                 :1;
        unsigned                        :1;
        unsigned RXBIMD                 :1;
        unsigned WUE                    :1;
        unsigned                        :2;
        unsigned ON                     :1;
    };
    struct {
        unsigned U5SENDB                :1;
        unsigned U5BRKOVR               :1;
        unsigned                        :1;
        unsigned U5RXBIMD               :1;
        unsigned U5WUE                  :1;
        unsigned                        :2;
        unsigned U5ON                   :1;
    };
} U5CON1bits_t;
extern volatile U5CON1bits_t U5CON1bits __at(0x2F8);
// bitfield macros
#define _U5CON1_SENDB_POSN                                  0x0
#define _U5CON1_SENDB_POSITION                              0x0
#define _U5CON1_SENDB_SIZE                                  0x1
#define _U5CON1_SENDB_LENGTH                                0x1
#define _U5CON1_SENDB_MASK                                  0x1
#define _U5CON1_BRKOVR_POSN                                 0x1
#define _U5CON1_BRKOVR_POSITION                             0x1
#define _U5CON1_BRKOVR_SIZE                                 0x1
#define _U5CON1_BRKOVR_LENGTH                               0x1
#define _U5CON1_BRKOVR_MASK                                 0x2
#define _U5CON1_RXBIMD_POSN                                 0x3
#define _U5CON1_RXBIMD_POSITION                             0x3
#define _U5CON1_RXBIMD_SIZE                                 0x1
#define _U5CON1_RXBIMD_LENGTH                               0x1
#define _U5CON1_RXBIMD_MASK                                 0x8
#define _U5CON1_WUE_POSN                                    0x4
#define _U5CON1_WUE_POSITION                                0x4
#define _U5CON1_WUE_SIZE                                    0x1
#define _U5CON1_WUE_LENGTH                                  0x1
#define _U5CON1_WUE_MASK                                    0x10
#define _U5CON1_ON_POSN                                     0x7
#define _U5CON1_ON_POSITION                                 0x7
#define _U5CON1_ON_SIZE                                     0x1
#define _U5CON1_ON_LENGTH                                   0x1
#define _U5CON1_ON_MASK                                     0x80
#define _U5CON1_U5SENDB_POSN                                0x0
#define _U5CON1_U5SENDB_POSITION                            0x0
#define _U5CON1_U5SENDB_SIZE                                0x1
#define _U5CON1_U5SENDB_LENGTH                              0x1
#define _U5CON1_U5SENDB_MASK                                0x1
#define _U5CON1_U5BRKOVR_POSN                               0x1
#define _U5CON1_U5BRKOVR_POSITION                           0x1
#define _U5CON1_U5BRKOVR_SIZE                               0x1
#define _U5CON1_U5BRKOVR_LENGTH                             0x1
#define _U5CON1_U5BRKOVR_MASK                               0x2
#define _U5CON1_U5RXBIMD_POSN                               0x3
#define _U5CON1_U5RXBIMD_POSITION                           0x3
#define _U5CON1_U5RXBIMD_SIZE                               0x1
#define _U5CON1_U5RXBIMD_LENGTH                             0x1
#define _U5CON1_U5RXBIMD_MASK                               0x8
#define _U5CON1_U5WUE_POSN                                  0x4
#define _U5CON1_U5WUE_POSITION                              0x4
#define _U5CON1_U5WUE_SIZE                                  0x1
#define _U5CON1_U5WUE_LENGTH                                0x1
#define _U5CON1_U5WUE_MASK                                  0x10
#define _U5CON1_U5ON_POSN                                   0x7
#define _U5CON1_U5ON_POSITION                               0x7
#define _U5CON1_U5ON_SIZE                                   0x1
#define _U5CON1_U5ON_LENGTH                                 0x1
#define _U5CON1_U5ON_MASK                                   0x80

// Register: U5CON2
#define U5CON2 U5CON2
extern volatile unsigned char           U5CON2              __at(0x2F9);
#ifndef _LIB_BUILD
asm("U5CON2 equ 02F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLO                    :2;
        unsigned TXPOL                  :1;
        unsigned                        :1;
        unsigned STP                    :2;
        unsigned RXPOL                  :1;
        unsigned RUNOVF                 :1;
    };
    struct {
        unsigned FLO0                   :1;
        unsigned FLO1                   :1;
        unsigned                        :2;
        unsigned STP0                   :1;
        unsigned STP1                   :1;
    };
    struct {
        unsigned U5FLO                  :2;
        unsigned U5TXPOL                :1;
        unsigned                        :1;
        unsigned U5STP                  :2;
        unsigned U5RXPOL                :1;
        unsigned U5RUNOVF               :1;
    };
    struct {
        unsigned U5FLO0                 :1;
        unsigned U5FLO1                 :1;
        unsigned                        :2;
        unsigned U5STP0                 :1;
        unsigned U5STP1                 :1;
    };
} U5CON2bits_t;
extern volatile U5CON2bits_t U5CON2bits __at(0x2F9);
// bitfield macros
#define _U5CON2_FLO_POSN                                    0x0
#define _U5CON2_FLO_POSITION                                0x0
#define _U5CON2_FLO_SIZE                                    0x2
#define _U5CON2_FLO_LENGTH                                  0x2
#define _U5CON2_FLO_MASK                                    0x3
#define _U5CON2_TXPOL_POSN                                  0x2
#define _U5CON2_TXPOL_POSITION                              0x2
#define _U5CON2_TXPOL_SIZE                                  0x1
#define _U5CON2_TXPOL_LENGTH                                0x1
#define _U5CON2_TXPOL_MASK                                  0x4
#define _U5CON2_STP_POSN                                    0x4
#define _U5CON2_STP_POSITION                                0x4
#define _U5CON2_STP_SIZE                                    0x2
#define _U5CON2_STP_LENGTH                                  0x2
#define _U5CON2_STP_MASK                                    0x30
#define _U5CON2_RXPOL_POSN                                  0x6
#define _U5CON2_RXPOL_POSITION                              0x6
#define _U5CON2_RXPOL_SIZE                                  0x1
#define _U5CON2_RXPOL_LENGTH                                0x1
#define _U5CON2_RXPOL_MASK                                  0x40
#define _U5CON2_RUNOVF_POSN                                 0x7
#define _U5CON2_RUNOVF_POSITION                             0x7
#define _U5CON2_RUNOVF_SIZE                                 0x1
#define _U5CON2_RUNOVF_LENGTH                               0x1
#define _U5CON2_RUNOVF_MASK                                 0x80
#define _U5CON2_FLO0_POSN                                   0x0
#define _U5CON2_FLO0_POSITION                               0x0
#define _U5CON2_FLO0_SIZE                                   0x1
#define _U5CON2_FLO0_LENGTH                                 0x1
#define _U5CON2_FLO0_MASK                                   0x1
#define _U5CON2_FLO1_POSN                                   0x1
#define _U5CON2_FLO1_POSITION                               0x1
#define _U5CON2_FLO1_SIZE                                   0x1
#define _U5CON2_FLO1_LENGTH                                 0x1
#define _U5CON2_FLO1_MASK                                   0x2
#define _U5CON2_STP0_POSN                                   0x4
#define _U5CON2_STP0_POSITION                               0x4
#define _U5CON2_STP0_SIZE                                   0x1
#define _U5CON2_STP0_LENGTH                                 0x1
#define _U5CON2_STP0_MASK                                   0x10
#define _U5CON2_STP1_POSN                                   0x5
#define _U5CON2_STP1_POSITION                               0x5
#define _U5CON2_STP1_SIZE                                   0x1
#define _U5CON2_STP1_LENGTH                                 0x1
#define _U5CON2_STP1_MASK                                   0x20
#define _U5CON2_U5FLO_POSN                                  0x0
#define _U5CON2_U5FLO_POSITION                              0x0
#define _U5CON2_U5FLO_SIZE                                  0x2
#define _U5CON2_U5FLO_LENGTH                                0x2
#define _U5CON2_U5FLO_MASK                                  0x3
#define _U5CON2_U5TXPOL_POSN                                0x2
#define _U5CON2_U5TXPOL_POSITION                            0x2
#define _U5CON2_U5TXPOL_SIZE                                0x1
#define _U5CON2_U5TXPOL_LENGTH                              0x1
#define _U5CON2_U5TXPOL_MASK                                0x4
#define _U5CON2_U5STP_POSN                                  0x4
#define _U5CON2_U5STP_POSITION                              0x4
#define _U5CON2_U5STP_SIZE                                  0x2
#define _U5CON2_U5STP_LENGTH                                0x2
#define _U5CON2_U5STP_MASK                                  0x30
#define _U5CON2_U5RXPOL_POSN                                0x6
#define _U5CON2_U5RXPOL_POSITION                            0x6
#define _U5CON2_U5RXPOL_SIZE                                0x1
#define _U5CON2_U5RXPOL_LENGTH                              0x1
#define _U5CON2_U5RXPOL_MASK                                0x40
#define _U5CON2_U5RUNOVF_POSN                               0x7
#define _U5CON2_U5RUNOVF_POSITION                           0x7
#define _U5CON2_U5RUNOVF_SIZE                               0x1
#define _U5CON2_U5RUNOVF_LENGTH                             0x1
#define _U5CON2_U5RUNOVF_MASK                               0x80
#define _U5CON2_U5FLO0_POSN                                 0x0
#define _U5CON2_U5FLO0_POSITION                             0x0
#define _U5CON2_U5FLO0_SIZE                                 0x1
#define _U5CON2_U5FLO0_LENGTH                               0x1
#define _U5CON2_U5FLO0_MASK                                 0x1
#define _U5CON2_U5FLO1_POSN                                 0x1
#define _U5CON2_U5FLO1_POSITION                             0x1
#define _U5CON2_U5FLO1_SIZE                                 0x1
#define _U5CON2_U5FLO1_LENGTH                               0x1
#define _U5CON2_U5FLO1_MASK                                 0x2
#define _U5CON2_U5STP0_POSN                                 0x4
#define _U5CON2_U5STP0_POSITION                             0x4
#define _U5CON2_U5STP0_SIZE                                 0x1
#define _U5CON2_U5STP0_LENGTH                               0x1
#define _U5CON2_U5STP0_MASK                                 0x10
#define _U5CON2_U5STP1_POSN                                 0x5
#define _U5CON2_U5STP1_POSITION                             0x5
#define _U5CON2_U5STP1_SIZE                                 0x1
#define _U5CON2_U5STP1_LENGTH                               0x1
#define _U5CON2_U5STP1_MASK                                 0x20

