MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
// Register: U5BRG
#define U5BRG U5BRG
extern volatile unsigned short          U5BRG               __at(0x2FA);
#ifndef _LIB_BUILD
asm("U5BRG equ 02FAh");
#endif

// Register: U5BRGL
#define U5BRGL U5BRGL
extern volatile unsigned char           U5BRGL              __at(0x2FA);
#ifndef _LIB_BUILD
asm("U5BRGL equ 02FAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGL                   :8;
    };
} U5BRGLbits_t;
extern volatile U5BRGLbits_t U5BRGLbits __at(0x2FA);
// bitfield macros
#define _U5BRGL_BRGL_POSN                                   0x0
#define _U5BRGL_BRGL_POSITION                               0x0
#define _U5BRGL_BRGL_SIZE                                   0x8
#define _U5BRGL_BRGL_LENGTH                                 0x8
#define _U5BRGL_BRGL_MASK                                   0xFF

// Register: U5BRGH
#define U5BRGH U5BRGH
extern volatile unsigned char           U5BRGH              __at(0x2FB);
#ifndef _LIB_BUILD
asm("U5BRGH equ 02FBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BRGH                   :8;
    };
} U5BRGHbits_t;
extern volatile U5BRGHbits_t U5BRGHbits __at(0x2FB);
// bitfield macros
#define _U5BRGH_BRGH_POSN                                   0x0
#define _U5BRGH_BRGH_POSITION                               0x0
#define _U5BRGH_BRGH_SIZE                                   0x8
#define _U5BRGH_BRGH_LENGTH                                 0x8
#define _U5BRGH_BRGH_MASK                                   0xFF

// Register: U5FIFO
#define U5FIFO U5FIFO
extern volatile unsigned char           U5FIFO              __at(0x2FC);
#ifndef _LIB_BUILD
asm("U5FIFO equ 02FCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXBF                   :1;
        unsigned RXBE                   :1;
        unsigned XON                    :1;
        unsigned RXIDL                  :1;
        unsigned TXBF                   :1;
        unsigned TXBE                   :1;
        unsigned STPMD                  :1;
        unsigned TXWRE                  :1;
    };
    struct {
        unsigned U5RXBF                 :1;
        unsigned U5RXBE                 :1;
        unsigned U5XON                  :1;
        unsigned U5RXIDL                :1;
        unsigned U5TXBF                 :1;
        unsigned U5TXBE                 :1;
        unsigned U5STPMD                :1;
        unsigned U5TXWRE                :1;
    };
    struct {
        unsigned                        :3;
        unsigned U5RCIDL                :1;
    };
    struct {
        unsigned                        :3;
        unsigned RCIDL                  :1;
    };
} U5FIFObits_t;
extern volatile U5FIFObits_t U5FIFObits __at(0x2FC);
// bitfield macros
#define _U5FIFO_RXBF_POSN                                   0x0
#define _U5FIFO_RXBF_POSITION                               0x0
#define _U5FIFO_RXBF_SIZE                                   0x1
#define _U5FIFO_RXBF_LENGTH                                 0x1
#define _U5FIFO_RXBF_MASK                                   0x1
#define _U5FIFO_RXBE_POSN                                   0x1
#define _U5FIFO_RXBE_POSITION                               0x1
#define _U5FIFO_RXBE_SIZE                                   0x1
#define _U5FIFO_RXBE_LENGTH                                 0x1
#define _U5FIFO_RXBE_MASK                                   0x2
#define _U5FIFO_XON_POSN                                    0x2
#define _U5FIFO_XON_POSITION                                0x2
#define _U5FIFO_XON_SIZE                                    0x1
#define _U5FIFO_XON_LENGTH                                  0x1
#define _U5FIFO_XON_MASK                                    0x4
#define _U5FIFO_RXIDL_POSN                                  0x3
#define _U5FIFO_RXIDL_POSITION                              0x3
#define _U5FIFO_RXIDL_SIZE                                  0x1
#define _U5FIFO_RXIDL_LENGTH                                0x1
#define _U5FIFO_RXIDL_MASK                                  0x8
#define _U5FIFO_TXBF_POSN                                   0x4
#define _U5FIFO_TXBF_POSITION                               0x4
#define _U5FIFO_TXBF_SIZE                                   0x1
#define _U5FIFO_TXBF_LENGTH                                 0x1
#define _U5FIFO_TXBF_MASK                                   0x10
#define _U5FIFO_TXBE_POSN                                   0x5
#define _U5FIFO_TXBE_POSITION                               0x5
#define _U5FIFO_TXBE_SIZE                                   0x1
#define _U5FIFO_TXBE_LENGTH                                 0x1
#define _U5FIFO_TXBE_MASK                                   0x20
#define _U5FIFO_STPMD_POSN                                  0x6
#define _U5FIFO_STPMD_POSITION                              0x6
#define _U5FIFO_STPMD_SIZE                                  0x1
#define _U5FIFO_STPMD_LENGTH                                0x1
#define _U5FIFO_STPMD_MASK                                  0x40
#define _U5FIFO_TXWRE_POSN                                  0x7
#define _U5FIFO_TXWRE_POSITION                              0x7
#define _U5FIFO_TXWRE_SIZE                                  0x1
#define _U5FIFO_TXWRE_LENGTH                                0x1
#define _U5FIFO_TXWRE_MASK                                  0x80
#define _U5FIFO_U5RXBF_POSN                                 0x0
#define _U5FIFO_U5RXBF_POSITION                             0x0
#define _U5FIFO_U5RXBF_SIZE                                 0x1
#define _U5FIFO_U5RXBF_LENGTH                               0x1
#define _U5FIFO_U5RXBF_MASK                                 0x1
#define _U5FIFO_U5RXBE_POSN                                 0x1
#define _U5FIFO_U5RXBE_POSITION                             0x1
#define _U5FIFO_U5RXBE_SIZE                                 0x1
#define _U5FIFO_U5RXBE_LENGTH                               0x1
#define _U5FIFO_U5RXBE_MASK                                 0x2
#define _U5FIFO_U5XON_POSN                                  0x2
#define _U5FIFO_U5XON_POSITION                              0x2
#define _U5FIFO_U5XON_SIZE                                  0x1
#define _U5FIFO_U5XON_LENGTH                                0x1
#define _U5FIFO_U5XON_MASK                                  0x4
#define _U5FIFO_U5RXIDL_POSN                                0x3
#define _U5FIFO_U5RXIDL_POSITION                            0x3
#define _U5FIFO_U5RXIDL_SIZE                                0x1
#define _U5FIFO_U5RXIDL_LENGTH                              0x1
#define _U5FIFO_U5RXIDL_MASK                                0x8
#define _U5FIFO_U5TXBF_POSN                                 0x4
#define _U5FIFO_U5TXBF_POSITION                             0x4
#define _U5FIFO_U5TXBF_SIZE                                 0x1
#define _U5FIFO_U5TXBF_LENGTH                               0x1
#define _U5FIFO_U5TXBF_MASK                                 0x10
#define _U5FIFO_U5TXBE_POSN                                 0x5
#define _U5FIFO_U5TXBE_POSITION                             0x5
#define _U5FIFO_U5TXBE_SIZE                                 0x1
#define _U5FIFO_U5TXBE_LENGTH                               0x1
#define _U5FIFO_U5TXBE_MASK                                 0x20
#define _U5FIFO_U5STPMD_POSN                                0x6
#define _U5FIFO_U5STPMD_POSITION                            0x6
#define _U5FIFO_U5STPMD_SIZE                                0x1
#define _U5FIFO_U5STPMD_LENGTH                              0x1
#define _U5FIFO_U5STPMD_MASK                                0x40
#define _U5FIFO_U5TXWRE_POSN                                0x7
#define _U5FIFO_U5TXWRE_POSITION                            0x7
#define _U5FIFO_U5TXWRE_SIZE                                0x1
#define _U5FIFO_U5TXWRE_LENGTH                              0x1
#define _U5FIFO_U5TXWRE_MASK                                0x80
#define _U5FIFO_U5RCIDL_POSN                                0x3
#define _U5FIFO_U5RCIDL_POSITION                            0x3
#define _U5FIFO_U5RCIDL_SIZE                                0x1
#define _U5FIFO_U5RCIDL_LENGTH                              0x1
#define _U5FIFO_U5RCIDL_MASK                                0x8
#define _U5FIFO_RCIDL_POSN                                  0x3
#define _U5FIFO_RCIDL_POSITION                              0x3
#define _U5FIFO_RCIDL_SIZE                                  0x1
#define _U5FIFO_RCIDL_LENGTH                                0x1
#define _U5FIFO_RCIDL_MASK                                  0x8

