MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
// Register: NCO1CLK
#define NCO1CLK NCO1CLK
extern volatile unsigned char           NCO1CLK             __at(0x447);
#ifndef _LIB_BUILD
asm("NCO1CLK equ 0447h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CKS                    :5;
        unsigned PWS                    :3;
    };
    struct {
        unsigned CKS0                   :1;
        unsigned CKS1                   :1;
        unsigned CKS2                   :1;
        unsigned CKS3                   :1;
        unsigned CKS4                   :1;
        unsigned PWS0                   :1;
        unsigned PWS1                   :1;
        unsigned PWS2                   :1;
    };
    struct {
        unsigned NCO1CKS                :5;
        unsigned NCO1PWS                :3;
    };
    struct {
        unsigned NCO1CKS0               :1;
        unsigned NCO1CKS1               :1;
        unsigned NCO1CKS2               :1;
        unsigned NCO1CKS3               :1;
        unsigned NCO1CKS4               :1;
        unsigned NCO1PWS0               :1;
        unsigned NCO1PWS1               :1;
        unsigned NCO1PWS2               :1;
    };
} NCO1CLKbits_t;
extern volatile NCO1CLKbits_t NCO1CLKbits __at(0x447);
// bitfield macros
#define _NCO1CLK_CKS_POSN                                   0x0
#define _NCO1CLK_CKS_POSITION                               0x0
#define _NCO1CLK_CKS_SIZE                                   0x5
#define _NCO1CLK_CKS_LENGTH                                 0x5
#define _NCO1CLK_CKS_MASK                                   0x1F
#define _NCO1CLK_PWS_POSN                                   0x5
#define _NCO1CLK_PWS_POSITION                               0x5
#define _NCO1CLK_PWS_SIZE                                   0x3
#define _NCO1CLK_PWS_LENGTH                                 0x3
#define _NCO1CLK_PWS_MASK                                   0xE0
#define _NCO1CLK_CKS0_POSN                                  0x0
#define _NCO1CLK_CKS0_POSITION                              0x0
#define _NCO1CLK_CKS0_SIZE                                  0x1
#define _NCO1CLK_CKS0_LENGTH                                0x1
#define _NCO1CLK_CKS0_MASK                                  0x1
#define _NCO1CLK_CKS1_POSN                                  0x1
#define _NCO1CLK_CKS1_POSITION                              0x1
#define _NCO1CLK_CKS1_SIZE                                  0x1
#define _NCO1CLK_CKS1_LENGTH                                0x1
#define _NCO1CLK_CKS1_MASK                                  0x2
#define _NCO1CLK_CKS2_POSN                                  0x2
#define _NCO1CLK_CKS2_POSITION                              0x2
#define _NCO1CLK_CKS2_SIZE                                  0x1
#define _NCO1CLK_CKS2_LENGTH                                0x1
#define _NCO1CLK_CKS2_MASK                                  0x4
#define _NCO1CLK_CKS3_POSN                                  0x3
#define _NCO1CLK_CKS3_POSITION                              0x3
#define _NCO1CLK_CKS3_SIZE                                  0x1
#define _NCO1CLK_CKS3_LENGTH                                0x1
#define _NCO1CLK_CKS3_MASK                                  0x8
#define _NCO1CLK_CKS4_POSN                                  0x4
#define _NCO1CLK_CKS4_POSITION                              0x4
#define _NCO1CLK_CKS4_SIZE                                  0x1
#define _NCO1CLK_CKS4_LENGTH                                0x1
#define _NCO1CLK_CKS4_MASK                                  0x10
#define _NCO1CLK_PWS0_POSN                                  0x5
#define _NCO1CLK_PWS0_POSITION                              0x5
#define _NCO1CLK_PWS0_SIZE                                  0x1
#define _NCO1CLK_PWS0_LENGTH                                0x1
#define _NCO1CLK_PWS0_MASK                                  0x20
#define _NCO1CLK_PWS1_POSN                                  0x6
#define _NCO1CLK_PWS1_POSITION                              0x6
#define _NCO1CLK_PWS1_SIZE                                  0x1
#define _NCO1CLK_PWS1_LENGTH                                0x1
#define _NCO1CLK_PWS1_MASK                                  0x40
#define _NCO1CLK_PWS2_POSN                                  0x7
#define _NCO1CLK_PWS2_POSITION                              0x7
#define _NCO1CLK_PWS2_SIZE                                  0x1
#define _NCO1CLK_PWS2_LENGTH                                0x1
#define _NCO1CLK_PWS2_MASK                                  0x80
#define _NCO1CLK_NCO1CKS_POSN                               0x0
#define _NCO1CLK_NCO1CKS_POSITION                           0x0
#define _NCO1CLK_NCO1CKS_SIZE                               0x5
#define _NCO1CLK_NCO1CKS_LENGTH                             0x5
#define _NCO1CLK_NCO1CKS_MASK                               0x1F
#define _NCO1CLK_NCO1PWS_POSN                               0x5
#define _NCO1CLK_NCO1PWS_POSITION                           0x5
#define _NCO1CLK_NCO1PWS_SIZE                               0x3
#define _NCO1CLK_NCO1PWS_LENGTH                             0x3
#define _NCO1CLK_NCO1PWS_MASK                               0xE0
#define _NCO1CLK_NCO1CKS0_POSN                              0x0
#define _NCO1CLK_NCO1CKS0_POSITION                          0x0
#define _NCO1CLK_NCO1CKS0_SIZE                              0x1
#define _NCO1CLK_NCO1CKS0_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS0_MASK                              0x1
#define _NCO1CLK_NCO1CKS1_POSN                              0x1
#define _NCO1CLK_NCO1CKS1_POSITION                          0x1
#define _NCO1CLK_NCO1CKS1_SIZE                              0x1
#define _NCO1CLK_NCO1CKS1_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS1_MASK                              0x2
#define _NCO1CLK_NCO1CKS2_POSN                              0x2
#define _NCO1CLK_NCO1CKS2_POSITION                          0x2
#define _NCO1CLK_NCO1CKS2_SIZE                              0x1
#define _NCO1CLK_NCO1CKS2_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS2_MASK                              0x4
#define _NCO1CLK_NCO1CKS3_POSN                              0x3
#define _NCO1CLK_NCO1CKS3_POSITION                          0x3
#define _NCO1CLK_NCO1CKS3_SIZE                              0x1
#define _NCO1CLK_NCO1CKS3_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS3_MASK                              0x8
#define _NCO1CLK_NCO1CKS4_POSN                              0x4
#define _NCO1CLK_NCO1CKS4_POSITION                          0x4
#define _NCO1CLK_NCO1CKS4_SIZE                              0x1
#define _NCO1CLK_NCO1CKS4_LENGTH                            0x1
#define _NCO1CLK_NCO1CKS4_MASK                              0x10
#define _NCO1CLK_NCO1PWS0_POSN                              0x5
#define _NCO1CLK_NCO1PWS0_POSITION                          0x5
#define _NCO1CLK_NCO1PWS0_SIZE                              0x1
#define _NCO1CLK_NCO1PWS0_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS0_MASK                              0x20
#define _NCO1CLK_NCO1PWS1_POSN                              0x6
#define _NCO1CLK_NCO1PWS1_POSITION                          0x6
#define _NCO1CLK_NCO1PWS1_SIZE                              0x1
#define _NCO1CLK_NCO1PWS1_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS1_MASK                              0x40
#define _NCO1CLK_NCO1PWS2_POSN                              0x7
#define _NCO1CLK_NCO1PWS2_POSITION                          0x7
#define _NCO1CLK_NCO1PWS2_SIZE                              0x1
#define _NCO1CLK_NCO1PWS2_LENGTH                            0x1
#define _NCO1CLK_NCO1PWS2_MASK                              0x80

// Register: NCO2ACC
#define NCO2ACC NCO2ACC
#ifndef __CCI__
extern volatile __uint24                NCO2ACC             __at(0x448);
#endif
#ifndef _LIB_BUILD
asm("NCO2ACC equ 0448h");
#endif

