MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
// Register: IVTAD
#define IVTAD IVTAD
#ifndef __CCI__
extern volatile __uint24                IVTAD               __at(0x45A);
#endif
#ifndef _LIB_BUILD
asm("IVTAD equ 045Ah");
#endif

// Register: IVTADL
#define IVTADL IVTADL
extern volatile unsigned char           IVTADL              __at(0x45A);
#ifndef _LIB_BUILD
asm("IVTADL equ 045Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD0                    :1;
        unsigned AD1                    :1;
        unsigned AD2                    :1;
        unsigned AD3                    :1;
        unsigned AD4                    :1;
        unsigned AD5                    :1;
        unsigned AD6                    :1;
        unsigned AD7                    :1;
    };
} IVTADLbits_t;
extern volatile IVTADLbits_t IVTADLbits __at(0x45A);
// bitfield macros
#define _IVTADL_AD0_POSN                                    0x0
#define _IVTADL_AD0_POSITION                                0x0
#define _IVTADL_AD0_SIZE                                    0x1
#define _IVTADL_AD0_LENGTH                                  0x1
#define _IVTADL_AD0_MASK                                    0x1
#define _IVTADL_AD1_POSN                                    0x1
#define _IVTADL_AD1_POSITION                                0x1
#define _IVTADL_AD1_SIZE                                    0x1
#define _IVTADL_AD1_LENGTH                                  0x1
#define _IVTADL_AD1_MASK                                    0x2
#define _IVTADL_AD2_POSN                                    0x2
#define _IVTADL_AD2_POSITION                                0x2
#define _IVTADL_AD2_SIZE                                    0x1
#define _IVTADL_AD2_LENGTH                                  0x1
#define _IVTADL_AD2_MASK                                    0x4
#define _IVTADL_AD3_POSN                                    0x3
#define _IVTADL_AD3_POSITION                                0x3
#define _IVTADL_AD3_SIZE                                    0x1
#define _IVTADL_AD3_LENGTH                                  0x1
#define _IVTADL_AD3_MASK                                    0x8
#define _IVTADL_AD4_POSN                                    0x4
#define _IVTADL_AD4_POSITION                                0x4
#define _IVTADL_AD4_SIZE                                    0x1
#define _IVTADL_AD4_LENGTH                                  0x1
#define _IVTADL_AD4_MASK                                    0x10
#define _IVTADL_AD5_POSN                                    0x5
#define _IVTADL_AD5_POSITION                                0x5
#define _IVTADL_AD5_SIZE                                    0x1
#define _IVTADL_AD5_LENGTH                                  0x1
#define _IVTADL_AD5_MASK                                    0x20
#define _IVTADL_AD6_POSN                                    0x6
#define _IVTADL_AD6_POSITION                                0x6
#define _IVTADL_AD6_SIZE                                    0x1
#define _IVTADL_AD6_LENGTH                                  0x1
#define _IVTADL_AD6_MASK                                    0x40
#define _IVTADL_AD7_POSN                                    0x7
#define _IVTADL_AD7_POSITION                                0x7
#define _IVTADL_AD7_SIZE                                    0x1
#define _IVTADL_AD7_LENGTH                                  0x1
#define _IVTADL_AD7_MASK                                    0x80

// Register: IVTADH
#define IVTADH IVTADH
extern volatile unsigned char           IVTADH              __at(0x45B);
#ifndef _LIB_BUILD
asm("IVTADH equ 045Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD8                    :1;
        unsigned AD9                    :1;
        unsigned AD10                   :1;
        unsigned AD11                   :1;
        unsigned AD12                   :1;
        unsigned AD13                   :1;
        unsigned AD14                   :1;
        unsigned AD15                   :1;
    };
} IVTADHbits_t;
extern volatile IVTADHbits_t IVTADHbits __at(0x45B);
// bitfield macros
#define _IVTADH_AD8_POSN                                    0x0
#define _IVTADH_AD8_POSITION                                0x0
#define _IVTADH_AD8_SIZE                                    0x1
#define _IVTADH_AD8_LENGTH                                  0x1
#define _IVTADH_AD8_MASK                                    0x1
#define _IVTADH_AD9_POSN                                    0x1
#define _IVTADH_AD9_POSITION                                0x1
#define _IVTADH_AD9_SIZE                                    0x1
#define _IVTADH_AD9_LENGTH                                  0x1
#define _IVTADH_AD9_MASK                                    0x2
#define _IVTADH_AD10_POSN                                   0x2
#define _IVTADH_AD10_POSITION                               0x2
#define _IVTADH_AD10_SIZE                                   0x1
#define _IVTADH_AD10_LENGTH                                 0x1
#define _IVTADH_AD10_MASK                                   0x4
#define _IVTADH_AD11_POSN                                   0x3
#define _IVTADH_AD11_POSITION                               0x3
#define _IVTADH_AD11_SIZE                                   0x1
#define _IVTADH_AD11_LENGTH                                 0x1
#define _IVTADH_AD11_MASK                                   0x8
#define _IVTADH_AD12_POSN                                   0x4
#define _IVTADH_AD12_POSITION                               0x4
#define _IVTADH_AD12_SIZE                                   0x1
#define _IVTADH_AD12_LENGTH                                 0x1
#define _IVTADH_AD12_MASK                                   0x10
#define _IVTADH_AD13_POSN                                   0x5
#define _IVTADH_AD13_POSITION                               0x5
#define _IVTADH_AD13_SIZE                                   0x1
#define _IVTADH_AD13_LENGTH                                 0x1
#define _IVTADH_AD13_MASK                                   0x20
#define _IVTADH_AD14_POSN                                   0x6
#define _IVTADH_AD14_POSITION                               0x6
#define _IVTADH_AD14_SIZE                                   0x1
#define _IVTADH_AD14_LENGTH                                 0x1
#define _IVTADH_AD14_MASK                                   0x40
#define _IVTADH_AD15_POSN                                   0x7
#define _IVTADH_AD15_POSITION                               0x7
#define _IVTADH_AD15_SIZE                                   0x1
#define _IVTADH_AD15_LENGTH                                 0x1
#define _IVTADH_AD15_MASK                                   0x80

// Register: IVTADU
#define IVTADU IVTADU
extern volatile unsigned char           IVTADU              __at(0x45C);
#ifndef _LIB_BUILD
asm("IVTADU equ 045Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned AD16                   :1;
        unsigned AD17                   :1;
        unsigned AD18                   :1;
        unsigned AD19                   :1;
        unsigned AD20                   :1;
    };
} IVTADUbits_t;
extern volatile IVTADUbits_t IVTADUbits __at(0x45C);
// bitfield macros
#define _IVTADU_AD16_POSN                                   0x0
#define _IVTADU_AD16_POSITION                               0x0
#define _IVTADU_AD16_SIZE                                   0x1
#define _IVTADU_AD16_LENGTH                                 0x1
#define _IVTADU_AD16_MASK                                   0x1
#define _IVTADU_AD17_POSN                                   0x1
#define _IVTADU_AD17_POSITION                               0x1
#define _IVTADU_AD17_SIZE                                   0x1
#define _IVTADU_AD17_LENGTH                                 0x1
#define _IVTADU_AD17_MASK                                   0x2
#define _IVTADU_AD18_POSN                                   0x2
#define _IVTADU_AD18_POSITION                               0x2
#define _IVTADU_AD18_SIZE                                   0x1
#define _IVTADU_AD18_LENGTH                                 0x1
#define _IVTADU_AD18_MASK                                   0x4
#define _IVTADU_AD19_POSN                                   0x3
#define _IVTADU_AD19_POSITION                               0x3
#define _IVTADU_AD19_SIZE                                   0x1
#define _IVTADU_AD19_LENGTH                                 0x1
#define _IVTADU_AD19_MASK                                   0x8
#define _IVTADU_AD20_POSN                                   0x4
#define _IVTADU_AD20_POSITION                               0x4
#define _IVTADU_AD20_SIZE                                   0x1
#define _IVTADU_AD20_LENGTH                                 0x1
#define _IVTADU_AD20_MASK                                   0x10

