MikroElektronika/core_packages/PIC/XC8/def/PIC18F27Q43/mcu.h
// Register: PIR7
#define PIR7 PIR7
extern volatile unsigned char           PIR7                __at(0x4B5);
#ifndef _LIB_BUILD
asm("PIR7 equ 04B5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned I2C1RXIF               :1;
        unsigned I2C1TXIF               :1;
        unsigned I2C1IF                 :1;
        unsigned I2C1EIF                :1;
        unsigned                        :1;
        unsigned CLC3IF                 :1;
        unsigned PWM3PIF                :1;
        unsigned PWM3IF                 :1;
    };
} PIR7bits_t;
extern volatile PIR7bits_t PIR7bits __at(0x4B5);
// bitfield macros
#define _PIR7_I2C1RXIF_POSN                                 0x0
#define _PIR7_I2C1RXIF_POSITION                             0x0
#define _PIR7_I2C1RXIF_SIZE                                 0x1
#define _PIR7_I2C1RXIF_LENGTH                               0x1
#define _PIR7_I2C1RXIF_MASK                                 0x1
#define _PIR7_I2C1TXIF_POSN                                 0x1
#define _PIR7_I2C1TXIF_POSITION                             0x1
#define _PIR7_I2C1TXIF_SIZE                                 0x1
#define _PIR7_I2C1TXIF_LENGTH                               0x1
#define _PIR7_I2C1TXIF_MASK                                 0x2
#define _PIR7_I2C1IF_POSN                                   0x2
#define _PIR7_I2C1IF_POSITION                               0x2
#define _PIR7_I2C1IF_SIZE                                   0x1
#define _PIR7_I2C1IF_LENGTH                                 0x1
#define _PIR7_I2C1IF_MASK                                   0x4
#define _PIR7_I2C1EIF_POSN                                  0x3
#define _PIR7_I2C1EIF_POSITION                              0x3
#define _PIR7_I2C1EIF_SIZE                                  0x1
#define _PIR7_I2C1EIF_LENGTH                                0x1
#define _PIR7_I2C1EIF_MASK                                  0x8
#define _PIR7_CLC3IF_POSN                                   0x5
#define _PIR7_CLC3IF_POSITION                               0x5
#define _PIR7_CLC3IF_SIZE                                   0x1
#define _PIR7_CLC3IF_LENGTH                                 0x1
#define _PIR7_CLC3IF_MASK                                   0x20
#define _PIR7_PWM3PIF_POSN                                  0x6
#define _PIR7_PWM3PIF_POSITION                              0x6
#define _PIR7_PWM3PIF_SIZE                                  0x1
#define _PIR7_PWM3PIF_LENGTH                                0x1
#define _PIR7_PWM3PIF_MASK                                  0x40
#define _PIR7_PWM3IF_POSN                                   0x7
#define _PIR7_PWM3IF_POSITION                               0x7
#define _PIR7_PWM3IF_SIZE                                   0x1
#define _PIR7_PWM3IF_LENGTH                                 0x1
#define _PIR7_PWM3IF_MASK                                   0x80

// Register: PIR8
#define PIR8 PIR8
extern volatile unsigned char           PIR8                __at(0x4B6);
#ifndef _LIB_BUILD
asm("PIR8 equ 04B6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U2RXIF                 :1;
        unsigned U2TXIF                 :1;
        unsigned U2EIF                  :1;
        unsigned U2IF                   :1;
        unsigned TMR5IF                 :1;
        unsigned TMR5GIF                :1;
        unsigned CCP2IF                 :1;
        unsigned SCANIF                 :1;
    };
} PIR8bits_t;
extern volatile PIR8bits_t PIR8bits __at(0x4B6);
// bitfield macros
#define _PIR8_U2RXIF_POSN                                   0x0
#define _PIR8_U2RXIF_POSITION                               0x0
#define _PIR8_U2RXIF_SIZE                                   0x1
#define _PIR8_U2RXIF_LENGTH                                 0x1
#define _PIR8_U2RXIF_MASK                                   0x1
#define _PIR8_U2TXIF_POSN                                   0x1
#define _PIR8_U2TXIF_POSITION                               0x1
#define _PIR8_U2TXIF_SIZE                                   0x1
#define _PIR8_U2TXIF_LENGTH                                 0x1
#define _PIR8_U2TXIF_MASK                                   0x2
#define _PIR8_U2EIF_POSN                                    0x2
#define _PIR8_U2EIF_POSITION                                0x2
#define _PIR8_U2EIF_SIZE                                    0x1
#define _PIR8_U2EIF_LENGTH                                  0x1
#define _PIR8_U2EIF_MASK                                    0x4
#define _PIR8_U2IF_POSN                                     0x3
#define _PIR8_U2IF_POSITION                                 0x3
#define _PIR8_U2IF_SIZE                                     0x1
#define _PIR8_U2IF_LENGTH                                   0x1
#define _PIR8_U2IF_MASK                                     0x8
#define _PIR8_TMR5IF_POSN                                   0x4
#define _PIR8_TMR5IF_POSITION                               0x4
#define _PIR8_TMR5IF_SIZE                                   0x1
#define _PIR8_TMR5IF_LENGTH                                 0x1
#define _PIR8_TMR5IF_MASK                                   0x10
#define _PIR8_TMR5GIF_POSN                                  0x5
#define _PIR8_TMR5GIF_POSITION                              0x5
#define _PIR8_TMR5GIF_SIZE                                  0x1
#define _PIR8_TMR5GIF_LENGTH                                0x1
#define _PIR8_TMR5GIF_MASK                                  0x20
#define _PIR8_CCP2IF_POSN                                   0x6
#define _PIR8_CCP2IF_POSITION                               0x6
#define _PIR8_CCP2IF_SIZE                                   0x1
#define _PIR8_CCP2IF_LENGTH                                 0x1
#define _PIR8_CCP2IF_MASK                                   0x40
#define _PIR8_SCANIF_POSN                                   0x7
#define _PIR8_SCANIF_POSITION                               0x7
#define _PIR8_SCANIF_SIZE                                   0x1
#define _PIR8_SCANIF_LENGTH                                 0x1
#define _PIR8_SCANIF_MASK                                   0x80

// Register: PIR9
#define PIR9 PIR9
extern volatile unsigned char           PIR9                __at(0x4B7);
#ifndef _LIB_BUILD
asm("PIR9 equ 04B7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U3RXIF                 :1;
        unsigned U3TXIF                 :1;
        unsigned U3EIF                  :1;
        unsigned U3IF                   :1;
        unsigned                        :1;
        unsigned CLC4IF                 :1;
    };
} PIR9bits_t;
extern volatile PIR9bits_t PIR9bits __at(0x4B7);
// bitfield macros
#define _PIR9_U3RXIF_POSN                                   0x0
#define _PIR9_U3RXIF_POSITION                               0x0
#define _PIR9_U3RXIF_SIZE                                   0x1
#define _PIR9_U3RXIF_LENGTH                                 0x1
#define _PIR9_U3RXIF_MASK                                   0x1
#define _PIR9_U3TXIF_POSN                                   0x1
#define _PIR9_U3TXIF_POSITION                               0x1
#define _PIR9_U3TXIF_SIZE                                   0x1
#define _PIR9_U3TXIF_LENGTH                                 0x1
#define _PIR9_U3TXIF_MASK                                   0x2
#define _PIR9_U3EIF_POSN                                    0x2
#define _PIR9_U3EIF_POSITION                                0x2
#define _PIR9_U3EIF_SIZE                                    0x1
#define _PIR9_U3EIF_LENGTH                                  0x1
#define _PIR9_U3EIF_MASK                                    0x4
#define _PIR9_U3IF_POSN                                     0x3
#define _PIR9_U3IF_POSITION                                 0x3
#define _PIR9_U3IF_SIZE                                     0x1
#define _PIR9_U3IF_LENGTH                                   0x1
#define _PIR9_U3IF_MASK                                     0x8
#define _PIR9_CLC4IF_POSN                                   0x5
#define _PIR9_CLC4IF_POSITION                               0x5
#define _PIR9_CLC4IF_SIZE                                   0x1
#define _PIR9_CLC4IF_LENGTH                                 0x1
#define _PIR9_CLC4IF_MASK                                   0x20

// Register: PIR10
#define PIR10 PIR10
extern volatile unsigned char           PIR10               __at(0x4B8);
#ifndef _LIB_BUILD
asm("PIR10 equ 04B8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IF                 :1;
        unsigned CLC5IF                 :1;
        unsigned CWG2IF                 :1;
        unsigned NCO2IF                 :1;
        unsigned DMA3SCNTIF             :1;
        unsigned DMA3DCNTIF             :1;
        unsigned DMA3ORIF               :1;
        unsigned DMA3AIF                :1;
    };
} PIR10bits_t;
extern volatile PIR10bits_t PIR10bits __at(0x4B8);
// bitfield macros
#define _PIR10_INT2IF_POSN                                  0x0
#define _PIR10_INT2IF_POSITION                              0x0
#define _PIR10_INT2IF_SIZE                                  0x1
#define _PIR10_INT2IF_LENGTH                                0x1
#define _PIR10_INT2IF_MASK                                  0x1
#define _PIR10_CLC5IF_POSN                                  0x1
#define _PIR10_CLC5IF_POSITION                              0x1
#define _PIR10_CLC5IF_SIZE                                  0x1
#define _PIR10_CLC5IF_LENGTH                                0x1
#define _PIR10_CLC5IF_MASK                                  0x2
#define _PIR10_CWG2IF_POSN                                  0x2
#define _PIR10_CWG2IF_POSITION                              0x2
#define _PIR10_CWG2IF_SIZE                                  0x1
#define _PIR10_CWG2IF_LENGTH                                0x1
#define _PIR10_CWG2IF_MASK                                  0x4
#define _PIR10_NCO2IF_POSN                                  0x3
#define _PIR10_NCO2IF_POSITION                              0x3
#define _PIR10_NCO2IF_SIZE                                  0x1
#define _PIR10_NCO2IF_LENGTH                                0x1
#define _PIR10_NCO2IF_MASK                                  0x8
#define _PIR10_DMA3SCNTIF_POSN                              0x4
#define _PIR10_DMA3SCNTIF_POSITION                          0x4
#define _PIR10_DMA3SCNTIF_SIZE                              0x1
#define _PIR10_DMA3SCNTIF_LENGTH                            0x1
#define _PIR10_DMA3SCNTIF_MASK                              0x10
#define _PIR10_DMA3DCNTIF_POSN                              0x5
#define _PIR10_DMA3DCNTIF_POSITION                          0x5
#define _PIR10_DMA3DCNTIF_SIZE                              0x1
#define _PIR10_DMA3DCNTIF_LENGTH                            0x1
#define _PIR10_DMA3DCNTIF_MASK                              0x20
#define _PIR10_DMA3ORIF_POSN                                0x6
#define _PIR10_DMA3ORIF_POSITION                            0x6
#define _PIR10_DMA3ORIF_SIZE                                0x1
#define _PIR10_DMA3ORIF_LENGTH                              0x1
#define _PIR10_DMA3ORIF_MASK                                0x40
#define _PIR10_DMA3AIF_POSN                                 0x7
#define _PIR10_DMA3AIF_POSITION                             0x7
#define _PIR10_DMA3AIF_SIZE                                 0x1
#define _PIR10_DMA3AIF_LENGTH                               0x1
#define _PIR10_DMA3AIF_MASK                                 0x80

// Register: PIR11
#define PIR11 PIR11
extern volatile unsigned char           PIR11               __at(0x4B9);
#ifndef _LIB_BUILD
asm("PIR11 equ 04B9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP3IF                 :1;
        unsigned CLC6IF                 :1;
        unsigned CWG3IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned DMA4SCNTIF             :1;
        unsigned DMA4DCNTIF             :1;
        unsigned DMA4ORIF               :1;
        unsigned DMA4AIF                :1;
    };
} PIR11bits_t;
extern volatile PIR11bits_t PIR11bits __at(0x4B9);
// bitfield macros
#define _PIR11_CCP3IF_POSN                                  0x0
#define _PIR11_CCP3IF_POSITION                              0x0
#define _PIR11_CCP3IF_SIZE                                  0x1
#define _PIR11_CCP3IF_LENGTH                                0x1
#define _PIR11_CCP3IF_MASK                                  0x1
#define _PIR11_CLC6IF_POSN                                  0x1
#define _PIR11_CLC6IF_POSITION                              0x1
#define _PIR11_CLC6IF_SIZE                                  0x1
#define _PIR11_CLC6IF_LENGTH                                0x1
#define _PIR11_CLC6IF_MASK                                  0x2
#define _PIR11_CWG3IF_POSN                                  0x2
#define _PIR11_CWG3IF_POSITION                              0x2
#define _PIR11_CWG3IF_SIZE                                  0x1
#define _PIR11_CWG3IF_LENGTH                                0x1
#define _PIR11_CWG3IF_MASK                                  0x4
#define _PIR11_TMR4IF_POSN                                  0x3
#define _PIR11_TMR4IF_POSITION                              0x3
#define _PIR11_TMR4IF_SIZE                                  0x1
#define _PIR11_TMR4IF_LENGTH                                0x1
#define _PIR11_TMR4IF_MASK                                  0x8
#define _PIR11_DMA4SCNTIF_POSN                              0x4
#define _PIR11_DMA4SCNTIF_POSITION                          0x4
#define _PIR11_DMA4SCNTIF_SIZE                              0x1
#define _PIR11_DMA4SCNTIF_LENGTH                            0x1
#define _PIR11_DMA4SCNTIF_MASK                              0x10
#define _PIR11_DMA4DCNTIF_POSN                              0x5
#define _PIR11_DMA4DCNTIF_POSITION                          0x5
#define _PIR11_DMA4DCNTIF_SIZE                              0x1
#define _PIR11_DMA4DCNTIF_LENGTH                            0x1
#define _PIR11_DMA4DCNTIF_MASK                              0x20
#define _PIR11_DMA4ORIF_POSN                                0x6
#define _PIR11_DMA4ORIF_POSITION                            0x6
#define _PIR11_DMA4ORIF_SIZE                                0x1
#define _PIR11_DMA4ORIF_LENGTH                              0x1
#define _PIR11_DMA4ORIF_MASK                                0x40
#define _PIR11_DMA4AIF_POSN                                 0x7
#define _PIR11_DMA4AIF_POSITION                             0x7
#define _PIR11_DMA4AIF_SIZE                                 0x1
#define _PIR11_DMA4AIF_LENGTH                               0x1
#define _PIR11_DMA4AIF_MASK                                 0x80

// Register: PIR12
#define PIR12 PIR12
extern volatile unsigned char           PIR12               __at(0x4BA);
#ifndef _LIB_BUILD
asm("PIR12 equ 04BAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U4RXIF                 :1;
        unsigned U4TXIF                 :1;
        unsigned U4EIF                  :1;
        unsigned U4IF                   :1;
        unsigned DMA5SCNTIF             :1;
        unsigned DMA5DCNTIF             :1;
        unsigned DMA5ORIF               :1;
        unsigned DMA5AIF                :1;
    };
} PIR12bits_t;
extern volatile PIR12bits_t PIR12bits __at(0x4BA);
// bitfield macros
#define _PIR12_U4RXIF_POSN                                  0x0
#define _PIR12_U4RXIF_POSITION                              0x0
#define _PIR12_U4RXIF_SIZE                                  0x1
#define _PIR12_U4RXIF_LENGTH                                0x1
#define _PIR12_U4RXIF_MASK                                  0x1
#define _PIR12_U4TXIF_POSN                                  0x1
#define _PIR12_U4TXIF_POSITION                              0x1
#define _PIR12_U4TXIF_SIZE                                  0x1
#define _PIR12_U4TXIF_LENGTH                                0x1
#define _PIR12_U4TXIF_MASK                                  0x2
#define _PIR12_U4EIF_POSN                                   0x2
#define _PIR12_U4EIF_POSITION                               0x2
#define _PIR12_U4EIF_SIZE                                   0x1
#define _PIR12_U4EIF_LENGTH                                 0x1
#define _PIR12_U4EIF_MASK                                   0x4
#define _PIR12_U4IF_POSN                                    0x3
#define _PIR12_U4IF_POSITION                                0x3
#define _PIR12_U4IF_SIZE                                    0x1
#define _PIR12_U4IF_LENGTH                                  0x1
#define _PIR12_U4IF_MASK                                    0x8
#define _PIR12_DMA5SCNTIF_POSN                              0x4
#define _PIR12_DMA5SCNTIF_POSITION                          0x4
#define _PIR12_DMA5SCNTIF_SIZE                              0x1
#define _PIR12_DMA5SCNTIF_LENGTH                            0x1
#define _PIR12_DMA5SCNTIF_MASK                              0x10
#define _PIR12_DMA5DCNTIF_POSN                              0x5
#define _PIR12_DMA5DCNTIF_POSITION                          0x5
#define _PIR12_DMA5DCNTIF_SIZE                              0x1
#define _PIR12_DMA5DCNTIF_LENGTH                            0x1
#define _PIR12_DMA5DCNTIF_MASK                              0x20
#define _PIR12_DMA5ORIF_POSN                                0x6
#define _PIR12_DMA5ORIF_POSITION                            0x6
#define _PIR12_DMA5ORIF_SIZE                                0x1
#define _PIR12_DMA5ORIF_LENGTH                              0x1
#define _PIR12_DMA5ORIF_MASK                                0x40
#define _PIR12_DMA5AIF_POSN                                 0x7
#define _PIR12_DMA5AIF_POSITION                             0x7
#define _PIR12_DMA5AIF_SIZE                                 0x1
#define _PIR12_DMA5AIF_LENGTH                               0x1
#define _PIR12_DMA5AIF_MASK                                 0x80

// Register: PIR13
#define PIR13 PIR13
extern volatile unsigned char           PIR13               __at(0x4BB);
#ifndef _LIB_BUILD
asm("PIR13 equ 04BBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned U5RXIF                 :1;
        unsigned U5TXIF                 :1;
        unsigned U5EIF                  :1;
        unsigned U5IF                   :1;
        unsigned DMA6SCNTIF             :1;
        unsigned DMA6DCNTIF             :1;
        unsigned DMA6ORIF               :1;
        unsigned DMA6AIF                :1;
    };
} PIR13bits_t;
extern volatile PIR13bits_t PIR13bits __at(0x4BB);
// bitfield macros
#define _PIR13_U5RXIF_POSN                                  0x0
#define _PIR13_U5RXIF_POSITION                              0x0
#define _PIR13_U5RXIF_SIZE                                  0x1
#define _PIR13_U5RXIF_LENGTH                                0x1
#define _PIR13_U5RXIF_MASK                                  0x1
#define _PIR13_U5TXIF_POSN                                  0x1
#define _PIR13_U5TXIF_POSITION                              0x1
#define _PIR13_U5TXIF_SIZE                                  0x1
#define _PIR13_U5TXIF_LENGTH                                0x1
#define _PIR13_U5TXIF_MASK                                  0x2
#define _PIR13_U5EIF_POSN                                   0x2
#define _PIR13_U5EIF_POSITION                               0x2
#define _PIR13_U5EIF_SIZE                                   0x1
#define _PIR13_U5EIF_LENGTH                                 0x1
#define _PIR13_U5EIF_MASK                                   0x4
#define _PIR13_U5IF_POSN                                    0x3
#define _PIR13_U5IF_POSITION                                0x3
#define _PIR13_U5IF_SIZE                                    0x1
#define _PIR13_U5IF_LENGTH                                  0x1
#define _PIR13_U5IF_MASK                                    0x8
#define _PIR13_DMA6SCNTIF_POSN                              0x4
#define _PIR13_DMA6SCNTIF_POSITION                          0x4
#define _PIR13_DMA6SCNTIF_SIZE                              0x1
#define _PIR13_DMA6SCNTIF_LENGTH                            0x1
#define _PIR13_DMA6SCNTIF_MASK                              0x10
#define _PIR13_DMA6DCNTIF_POSN                              0x5
#define _PIR13_DMA6DCNTIF_POSITION                          0x5
#define _PIR13_DMA6DCNTIF_SIZE                              0x1
#define _PIR13_DMA6DCNTIF_LENGTH                            0x1
#define _PIR13_DMA6DCNTIF_MASK                              0x20
#define _PIR13_DMA6ORIF_POSN                                0x6
#define _PIR13_DMA6ORIF_POSITION                            0x6
#define _PIR13_DMA6ORIF_SIZE                                0x1
#define _PIR13_DMA6ORIF_LENGTH                              0x1
#define _PIR13_DMA6ORIF_MASK                                0x40
#define _PIR13_DMA6AIF_POSN                                 0x7
#define _PIR13_DMA6AIF_POSITION                             0x7
#define _PIR13_DMA6AIF_SIZE                                 0x1
#define _PIR13_DMA6AIF_LENGTH                               0x1
#define _PIR13_DMA6AIF_MASK                                 0x80

// Register: PIR14
#define PIR14 PIR14
extern volatile unsigned char           PIR14               __at(0x4BC);
#ifndef _LIB_BUILD
asm("PIR14 equ 04BCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned CLC7IF                 :1;
        unsigned C2IF                   :1;
        unsigned NCO3IF                 :1;
    };
} PIR14bits_t;
